(function(lang){
	lang.topic = "الشكل و الفراغ";
	lang.tip = "الموقع، الإتجاه والحركة";
	lang.writtenScript1TP = "";
	lang.writtenScript1EX = "";
	//--------------------------------------------------------------------------------------------------
	lang.setAnswer = function(x, y) {
		lang.Q1 = "ساعد الأرنب للحصول على مقعده في السينما.</br> انقر على المقعد الذي يظهر فى التذكرة.</br> انقر موافق."
		lang.Q11 = "ساعد القطة للحصول على مقعده في السينما.</br> انقر على المقعد الذي يظهر فى التذكرة.</br> انقر موافق.";
		lang.H1a = "هذا هو العمود "+x+".";
		lang.H1b = "هذا هو العمود "+x+".<br/>هذا هو الصف "+y+".";
		lang.H1c = "مكان تقاطعهم هو "+x+y+".";
		lang.H1d = "مكان تقاطعهم هو "+x+y+".<br/><br/>انقر فوق موافق عندما تكون مستعدا لإعادة المحاولة.";
		lang.H2 = "حاول الآن مرة أخرى.<br/>انقر على المقعد الذي يظهر فى التذكرة.<br/>انقر موافق.";
		lang.P1a = "ممتاز!";
		lang.P1b = "ممتاز!<br/> الأرنب يجلس في مقعد "+x+y+".<br/><br/>انقر فوق موافق.";
		lang.P11a = "ممتاز!";
		lang.P11b = "ممتاز!<br/>القط يجلس في مقعد "+x+y+".<br/><br/>انقر فوق موافق.";
		lang.P2a = "إلقاء نظرة على الشبكة.";
		lang.P2b = "إلقاء نظرة على الشبكة.<br/> هذا هو "+x+y+".";
		lang.P2c = "إلقاء نظرة على الشبكة.<br/> هذا هو "+x+y+".<br/><br/>انقر فوق موافق.";
	}
	//--------------------------------------------------------------------------------------------------
	lang.TP1a = "في هذه الشبكة، تُمثل الحروف الأعمدة";
	lang.TP1b = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود أ";
	lang.TP1c = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود ب";
	lang.TP1d = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود ج";
	lang.TP1e = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود د";
	lang.TP1f = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود هـ";
	lang.TP1g = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> هذا هو العمود و";
	lang.TP1h = "في هذه الشبكة، تُمثل الحروف الأعمدة<br/><br/> إضغط على السهم التالى للمتابعة";
	//--------------------------------------------------------------------------------------------------
	lang.TP2a = "في هذه الشبكة، تُمثل الحروف الصفوف.";
	lang.TP2b = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 1";
	lang.TP2c = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 2";
	lang.TP2d = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 3";
	lang.TP2e = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 4";
	lang.TP2f = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 5";
	lang.TP2g = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/> هذا هو الصف 6";
	lang.TP2h = "في هذه الشبكة، تُمثل الحروف الصفوف.<br/><br/>إضغط على السهم التالى للمتابعة";
	//--------------------------------------------------------------------------------------------------
	lang.TP3a = "يمكننا اختيار مقعد محدد من<br/> خلال حرف و رقم مُعطى.<br/> شاهد...";
	lang.TP3b = "يمكننا اختيار مقعد محدد من<br/> خلال حرف و رقم مُعطى.<br/> شاهد...";
	lang.TP3c = "هذا هو ب4";
	lang.TP3d = "هذا هو ب4<br/><br/> انقر فوق السهم إلى الأمام.";
	//--------------------------------------------------------------------------------------------------
	lang.TP4 = "إذهب عند إيجاد هـ3 ثم انقر فوق السهم إلى الأمام.";
	//--------------------------------------------------------------------------------------------------
	lang.TP5a = "هذا هو هـ3.";
	lang.TP5b = "هذا هو هـ3.<br/><br/>انقر فوق موافق لبدء التمرين";
	
	lang.TP_A = "أ";
	lang.TP_B = "ب";
	lang.TP_C = "ج";
	lang.TP_D = "د";
	lang.TP_E = "هـ";
	lang.TP_F = "و";
	lang.TP_B4 = "ب4";
	//--------------------------------------------------------------------------------------------------
})(lang_ar_MA_GBR_0850RAx0100 = lang_ar_MA_GBR_0850RAx0100||{});
var lang_ar_MA_GBR_0850RAx0100;